In [2]:
#1

import pandas as pd

data = {"App dev" : ["Java", "Flutter", "Kotalin"],
        "Web dev" : ["HTML", "CSS", "Javascript"],
        "Databases" : ["MySQL", "MangoDB", "Postgre"]}

df = pd.DataFrame(data)

print(df)

   App dev     Web dev Databases
0     Java        HTML     MySQL
1  Flutter         CSS   MangoDB
2  Kotalin  Javascript   Postgre

In [4]:
# 2
df = pd.read_csv("salaries.csv")

# 3
df = pd.read_excel("student_data.xlsx")

# 4
df.head()

# 5
df.tail()

          Name  Age Branch  Sem     College Name
4      Karthik   20     ME    2  MEI Polytechnic
5  Pruthvi Raj   22     EC    2  MEI Polytechnic
6       Ramesh   21     ME    1  SJP Polytechnic
7      Sumanth   34     CS    1  SJP Polytechnic
8       Suresh   45     CS    2  PVP Polytechnic

In [35]:
# 6
df.info()

# 7
df.describe()

# 8 
df.columns

# 9
df.index

# 10
df.shape

# 11
df["Name"]

# 12
df[["Name"]]

# 13
df[["Name", "Age"]]

# 14
df.iloc[0]

# 15
df.loc[0, "Name"]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          9 non-null      object
 1   Age           9 non-null      float64
 2   Branch        9 non-null      object
 3   Sem           9 non-null      float64
 4   College Name  9 non-null      object
 5   salary        4 non-null      float64
 6   s             4 non-null      float64
dtypes: float64(4), object(3)
memory usage: 860.0+ bytes

'Preetham'

In [36]:
# 16
df[df["Branch"] == "IS"]

# 17
df.sort_values(by="Age", ascending=False)

# 18
new_col = pd.DataFrame({"salary" : [20000, 30000, 100000, 30000]})

df["s"] = new_col

# 19
df["Age"].mean()

# 20
df.isnull()

df.isnull().sum()

Name            4
Age             4
Branch          4
Sem             4
College Name    4
salary          9
s               9
dtype: int64

In [ ]:
import pandas as pd

df = pd.read_csv("data.csv")

(4, 2)